week2/всд_неделя2/Enums/ТипыДокументовРаспознаваниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДокументовРаспознаваниеДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктОбОказанииУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеопределенныйДокумент</Name>
					<Comment>Форма документа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассовыйЧек</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

week2/всд_неделя2/Enums/НаправленияРаспознанногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НаправленияРаспознанногоДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

week2/всд_неделя2/CommonModules/РаспознаваниеДокументовПраваДоступа/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Заполнить справочники без прав на создание.
// 
// Параметры:
//  СправочникиБезПравНаСоздание - СписокЗначений Из Строка - Справочники без прав на создание
//  ГрупповаяОбработка - Булево - Групповая обработка
Процедура ЗаполнитьСправочникиБезПравНаСоздание(СправочникиБезПравНаСоздание, ГрупповаяОбработка = Ложь) Экспорт
		
	РаспознаваниеДокументовПереопределяемый.ЗаполнитьСправочникиБезПравНаСоздание(СправочникиБезПравНаСоздание);
	
КонецПроцедуры

Функция ЕстьПравоСозданияДокументаИзРаспознанного(Направление, ТипРаспознанногоДокумента, ВидДокумента = Неопределено) Экспорт
	
	Если ТипРаспознанногоДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.ТОРГ12
		Или ТипРаспознанногоДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг
		Или ТипРаспознанногоДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.УПД
		Или ТипРаспознанногоДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура Тогда
		
		Если Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда  
			ИмяТипа = ?(ВидДокумента = "ПТИУ", "ПриобретениеТоваровУслуг", "ПриобретениеУслугПрочихАктивов"); 
		Иначе
			ИмяТипа = ?(ВидДокумента = "РТИУ", "РеализацияТоваровУслуг", "РеализацияУслугПрочихАктивов"); 
		КонецЕсли;
		
	ИначеЕсли ТипРаспознанногоДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату Тогда
		
		ИмяТипа = "ЗаказПоставщику"; 
		
	КонецЕсли;

	//ТипСоздаваемого = Метаданные.ОпределяемыеТипы[ИмяТипа].Тип.Типы()[0];
	//
	//ПустаяСсылка = Новый(ТипСоздаваемого);
	//ИмяДокумента = ПустаяСсылка.Метаданные().Имя;
	
	Возврат ПравоДоступа("Добавление", Метаданные.Документы[ИмяТипа]);
	
КонецФункции

#КонецОбласти
